Tekla Open API Reference for Tekla Structures 2025
DataFilterExpression Methods
The DataFilterExpression type exposes the following members.
Methods
Name | Description
ToString
 Creates a string representation of the current object.
 (Overrides Expression.ToString().)
Top
See Also
Reference
DataFilterExpression Class
Tekla.Structures.Filtering Namespace